# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8-pose keypoints/pose estimation model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov8
# Task docs: https://docs.ultralytics.com/tasks/pose

# # Thank https://github.com/ultralytics/ultralytics/issues/6949

# Parameters
nc: 80
kpt_shape: [17, 3] # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolov8n-pose.yaml' will call yolov8-pose.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, ALSS, [128, 0.4, 0.4, 2, True, 2]] # 2
  - [-1, 1, ALSS, [256, 0.4, 0.4, 1, False, -1]]
  - [-1, 1, ALSS, [512, 0.5, 0.5, 2, True, 2]]
  - [-1, 1, ALSS, [512, 0.6, 0.6, 1, False, -1]]
  - [-1, 1, ALSS, [1024,0.7, 0.6, 2, True, 2]]
  - [-1, 1, SPPF, [1024, 5]] # 7

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 10

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 13 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 16 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 7], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 19 (P5/32-large)

  - [[13, 16, 19], 1, PoSeg, [nc, 32, 256, kpt_shape]]
